kywwilson11/nuttx/arch/arm/src/stm32h5/hardware/stm32h562xx_tim.h
#define STM32H5_TIM4_CR1            (STM32H5_TIM4_BASE + STM32H5_GTIM_CR1_OFFSET)
#define STM32H5_TIM4_CR2            (STM32H5_TIM4_BASE + STM32H5_GTIM_CR2_OFFSET)
#define STM32H5_TIM4_SMCR           (STM32H5_TIM4_BASE + STM32H5_GTIM_SMCR_OFFSET)
#define STM32H5_TIM4_DIER           (STM32H5_TIM4_BASE + STM32H5_GTIM_DIER_OFFSET)
#define STM32H5_TIM4_SR             (STM32H5_TIM4_BASE + STM32H5_GTIM_SR_OFFSET)
#define STM32H5_TIM4_EGR            (STM32H5_TIM4_BASE + STM32H5_GTIM_EGR_OFFSET)
#define STM32H5_TIM4_CCMR1          (STM32H5_TIM4_BASE + STM32H5_GTIM_CCMR1_OFFSET)
#define STM32H5_TIM4_CCMR2          (STM32H5_TIM4_BASE + STM32H5_GTIM_CCMR2_OFFSET)
#define STM32H5_TIM4_CCER           (STM32H5_TIM4_BASE + STM32H5_GTIM_CCER_OFFSET)
#define STM32H5_TIM4_CNT            (STM32H5_TIM4_BASE + STM32H5_GTIM_CNT_OFFSET)
#define STM32H5_TIM4_PSC            (STM32H5_TIM4_BASE + STM32H5_GTIM_PSC_OFFSET)
#define STM32H5_TIM4_ARR            (STM32H5_TIM4_BASE + STM32H5_GTIM_ARR_OFFSET)
#define STM32H5_TIM4_CCR1           (STM32H5_TIM4_BASE + STM32H5_GTIM_CCR1_OFFSET)
#define STM32H5_TIM4_CCR2           (STM32H5_TIM4_BASE + STM32H5_GTIM_CCR2_OFFSET)
#define STM32H5_TIM4_CCR3           (STM32H5_TIM4_BASE + STM32H5_GTIM_CCR3_OFFSET)
#define STM32H5_TIM4_CCR4           (STM32H5_TIM4_BASE + STM32H5_GTIM_CCR4_OFFSET)
#define STM32H5_TIM4_DCR            (STM32H5_TIM4_BASE + STM32H5_GTIM_DCR_OFFSET)
#define STM32H5_TIM4_DMAR           (STM32H5_TIM4_BASE + STM32H5_GTIM_DMAR_OFFSET)

#define STM32H5_TIM5_CR1            (STM32H5_TIM5_BASE + STM32H5_GTIM_CR1_OFFSET)
#define STM32H5_TIM5_CR2            (STM32H5_TIM5_BASE + STM32H5_GTIM_CR2_OFFSET)
#define STM32H5_TIM5_SMCR           (STM32H5_TIM5_BASE + STM32H5_GTIM_SMCR_OFFSET)
#define STM32H5_TIM5_DIER           (STM32H5_TIM5_BASE + STM32H5_GTIM_DIER_OFFSET)
#define STM32H5_TIM5_SR             (STM32H5_TIM5_BASE + STM32H5_GTIM_SR_OFFSET)
#define STM32H5_TIM5_EGR            (STM32H5_TIM5_BASE + STM32H5_GTIM_EGR_OFFSET)
#define STM32H5_TIM5_CCMR1          (STM32H5_TIM5_BASE + STM32H5_GTIM_CCMR1_OFFSET)
#define STM32H5_TIM5_CCMR2          (STM32H5_TIM5_BASE + STM32H5_GTIM_CCMR2_OFFSET)
#define STM32H5_TIM5_CCER           (STM32H5_TIM5_BASE + STM32H5_GTIM_CCER_OFFSET)
#define STM32H5_TIM5_CNT            (STM32H5_TIM5_BASE + STM32H5_GTIM_CNT_OFFSET)
#define STM32H5_TIM5_PSC            (STM32H5_TIM5_BASE + STM32H5_GTIM_PSC_OFFSET)
#define STM32H5_TIM5_ARR            (STM32H5_TIM5_BASE + STM32H5_GTIM_ARR_OFFSET)
#define STM32H5_TIM5_CCR1           (STM32H5_TIM5_BASE + STM32H5_GTIM_CCR1_OFFSET)
#define STM32H5_TIM5_CCR2           (STM32H5_TIM5_BASE + STM32H5_GTIM_CCR2_OFFSET)
#define STM32H5_TIM5_CCR3           (STM32H5_TIM5_BASE + STM32H5_GTIM_CCR3_OFFSET)
#define STM32H5_TIM5_CCR4           (STM32H5_TIM5_BASE + STM32H5_GTIM_CCR4_OFFSET)
#define STM32H5_TIM5_DCR            (STM32H5_TIM5_BASE + STM32H5_GTIM_DCR_OFFSET)
#define STM32H5_TIM5_DMAR           (STM32H5_TIM5_BASE + STM32H5_GTIM_DMAR_OFFSET)
#define STM32H5_TIM5_OR             (STM32H5_TIM5_BASE + STM32H5_GTIM_OR_OFFSET)

#define STM32H5_TIM15_CR1           (STM32H5_TIM15_BASE + STM32H5_GTIM_CR1_OFFSET)
#define STM32H5_TIM15_CR2           (STM32H5_TIM15_BASE + STM32H5_GTIM_CR2_OFFSET)
#define STM32H5_TIM15_SMCR          (STM32H5_TIM15_BASE + STM32H5_GTIM_SMCR_OFFSET)
#define STM32H5_TIM15_DIER          (STM32H5_TIM15_BASE + STM32H5_GTIM_DIER_OFFSET)
#define STM32H5_TIM15_SR            (STM32H5_TIM15_BASE + STM32H5_GTIM_SR_OFFSET)
#define STM32H5_TIM15_EGR           (STM32H5_TIM15_BASE + STM32H5_GTIM_EGR_OFFSET)
#define STM32H5_TIM15_CCMR1         (STM32H5_TIM15_BASE + STM32H5_GTIM_CCMR1_OFFSET)
#define STM32H5_TIM15_CCER          (STM32H5_TIM15_BASE + STM32H5_GTIM_CCER_OFFSET)
#define STM32H5_TIM15_CNT           (STM32H5_TIM15_BASE + STM32H5_GTIM_CNT_OFFSET)
#define STM32H5_TIM15_PSC           (STM32H5_TIM15_BASE + STM32H5_GTIM_PSC_OFFSET)
#define STM32H5_TIM15_ARR           (STM32H5_TIM15_BASE + STM32H5_GTIM_ARR_OFFSET)
#define STM32H5_TIM15_RCR           (STM32H5_TIM15_BASE + STM32H5_GTIM_RCR_OFFSET)
#define STM32H5_TIM15_CCR1          (STM32H5_TIM15_BASE + STM32H5_GTIM_CCR1_OFFSET)
#define STM32H5_TIM15_CCR2          (STM32H5_TIM15_BASE + STM32H5_GTIM_CCR2_OFFSET)
#define STM32H5_TIM15_BDTR          (STM32H5_TIM15_BASE + STM32H5_GTIM_BDTR_OFFSET)
#define STM32H5_TIM15_DCR           (STM32H5_TIM15_BASE + STM32H5_GTIM_DCR_OFFSET)
#define STM32H5_TIM15_DMAR          (STM32H5_TIM15_BASE + STM32H5_GTIM_DMAR_OFFSET)

#define STM32H5_TIM16_CR1           (STM32H5_TIM16_BASE + STM32H5_GTIM_CR1_OFFSET)
#define STM32H5_TIM16_CR2           (STM32H5_TIM16_BASE + STM32H5_GTIM_CR2_OFFSET)
#define STM32H5_TIM16_DIER          (STM32H5_TIM16_BASE + STM32H5_GTIM_DIER_OFFSET)
#define STM32H5_TIM16_SR            (STM32H5_TIM16_BASE + STM32H5_GTIM_SR_OFFSET)
#define STM32H5_TIM16_EGR           (STM32H5_TIM16_BASE + STM32H5_GTIM_EGR_OFFSET)
#define STM32H5_TIM16_CCMR1         (STM32H5_TIM16_BASE + STM32H5_GTIM_CCMR1_OFFSET)
#define STM32H5_TIM16_CCER          (STM32H5_TIM16_BASE + STM32H5_GTIM_CCER_OFFSET)
#define STM32H5_TIM16_CNT           (STM32H5_TIM16_BASE + STM32H5_GTIM_CNT_OFFSET)
#define STM32H5_TIM16_PSC           (STM32H5_TIM16_BASE + STM32H5_GTIM_PSC_OFFSET)
#define STM32H5_TIM16_ARR           (STM32H5_TIM16_BASE + STM32H5_GTIM_ARR_OFFSET)
#define STM32H5_TIM16_RCR           (STM32H5_TIM16_BASE + STM32H5_GTIM_RCR_OFFSET)
#define STM32H5_TIM16_CCR1          (STM32H5_TIM16_BASE + STM32H5_GTIM_CCR1_OFFSET)
#define STM32H5_TIM16_BDTR          (STM32H5_TIM16_BASE + STM32H5_GTIM_BDTR_OFFSET)
#define STM32H5_TIM16_DCR           (STM32H5_TIM16_BASE + STM32H5_GTIM_DCR_OFFSET)
#define STM32H5_TIM16_DMAR          (STM32H5_TIM16_BASE + STM32H5_GTIM_DMAR_OFFSET)
#define STM32H5_TIM16_OR            (STM32H5_TIM16_BASE + STM32H5_GTIM_OR_OFFSET)

#define STM32H5_TIM17_CR1           (STM32H5_TIM17_BASE + STM32H5_GTIM_CR1_OFFSET)
#define STM32H5_TIM17_CR2           (STM32H5_TIM17_BASE + STM32H5_GTIM_CR2_OFFSET)
#define STM32H5_TIM17_DIER          (STM32H5_TIM17_BASE + STM32H5_GTIM_DIER_OFFSET)
#define STM32H5_TIM17_SR            (STM32H5_TIM17_BASE + STM32H5_GTIM_SR_OFFSET)
#define STM32H5_TIM17_EGR           (STM32H5_TIM17_BASE + STM32H5_GTIM_EGR_OFFSET)
#define STM32H5_TIM17_CCMR1         (STM32H5_TIM17_BASE + STM32H5_GTIM_CCMR1_OFFSET)
#define STM32H5_TIM17_CCER          (STM32H5_TIM17_BASE + STM32H5_GTIM_CCER_OFFSET)
#define STM32H5_TIM17_CNT           (STM32H5_TIM17_BASE + STM32H5_GTIM_CNT_OFFSET)
#define STM32H5_TIM17_PSC           (STM32H5_TIM17_BASE + STM32H5_GTIM_PSC_OFFSET)
#define STM32H5_TIM17_ARR           (STM32H5_TIM17_BASE + STM32H5_GTIM_ARR_OFFSET)
#define STM32H5_TIM17_RCR           (STM32H5_TIM17_BASE + STM32H5_GTIM_RCR_OFFSET)
#define STM32H5_TIM17_CCR1          (STM32H5_TIM17_BASE + STM32H5_GTIM_CCR1_OFFSET)
#define STM32H5_TIM17_BDTR          (STM32H5_TIM17_BASE + STM32H5_GTIM_BDTR_OFFSET)
#define STM32H5_TIM17_DCR           (STM32H5_TIM17_BASE + STM32H5_GTIM_DCR_OFFSET)
#define STM32H5_TIM17_DMAR          (STM32H5_TIM17_BASE + STM32H5_GTIM_DMAR_OFFSET)

/* Basic Timers - TIM6 and TIM7 */

#define STM32H5_TIM6_CR1            (STM32H5_TIM6_BASE + STM32H5_BTIM_CR1_OFFSET)
#define STM32H5_TIM6_CR2            (STM32H5_TIM6_BASE + STM32H5_BTIM_CR2_OFFSET)
#define STM32H5_TIM6_DIER           (STM32H5_TIM6_BASE + STM32H5_BTIM_DIER_OFFSET)
#define STM32H5_TIM6_SR             (STM32H5_TIM6_BASE + STM32H5_BTIM_SR_OFFSET)
#define STM32H5_TIM6_EGR            (STM32H5_TIM6_BASE + STM32H5_BTIM_EGR_OFFSET)
#define STM32H5_TIM6_CNT            (STM32H5_TIM6_BASE + STM32H5_BTIM_CNT_OFFSET)
#define STM32H5_TIM6_PSC            (STM32H5_TIM6_BASE + STM32H5_BTIM_PSC_OFFSET)
#define STM32H5_TIM6_ARR            (STM32H5_TIM6_BASE + STM32H5_BTIM_ARR_OFFSET)

#define STM32H5_TIM7_CR1            (STM32H5_TIM7_BASE + STM32H5_BTIM_CR1_OFFSET)
#define STM32H5_TIM7_CR2            (STM32H5_TIM7_BASE + STM32H5_BTIM_CR2_OFFSET)
#define STM32H5_TIM7_DIER           (STM32H5_TIM7_BASE + STM32H5_BTIM_DIER_OFFSET)
#define STM32H5_TIM7_SR             (STM32H5_TIM7_BASE + STM32H5_BTIM_SR_OFFSET)
#define STM32H5_TIM7_EGR            (STM32H5_TIM7_BASE + STM32H5_BTIM_EGR_OFFSET)
#define STM32H5_TIM7_CNT            (STM32H5_TIM7_BASE + STM32H5_BTIM_CNT_OFFSET)
#define STM32H5_TIM7_PSC            (STM32H5_TIM7_BASE + STM32H5_BTIM_PSC_OFFSET)
#define STM32H5_TIM7_ARR            (STM32H5_TIM7_BASE + STM32H5_BTIM_ARR_OFFSET)

/* Register Bitfield Definitions ********************************************/

/* Control register 1 */

#define ATIM_CR1_CEN                (1 << 0)                  /* Bit 0: Counter enable */
#define ATIM_CR1_UDIS               (1 << 1)                  /* Bit 1: Update disable */
#define ATIM_CR1_URS                (1 << 2)                  /* Bit 2: Update request source */
#define ATIM_CR1_OPM                (1 << 3)                  /* Bit 3: One pulse mode */
#define ATIM_CR1_DIR                (1 << 4)                  /* Bit 4: Direction */
#define ATIM_CR1_CMS_SHIFT          (5)                       /* Bits 6-5: Center-aligned mode selection */
#define ATIM_CR1_CMS_MASK           (3 << ATIM_CR1_CMS_SHIFT)
#  define ATIM_CR1_EDGE             (0 << ATIM_CR1_CMS_SHIFT) /* 00: Edge-aligned mode */
#  define ATIM_CR1_CENTER1          (1 << ATIM_CR1_CMS_SHIFT) /* 01: Center-aligned mode 1 */
#  define ATIM_CR1_CENTER2          (2 << ATIM_CR1_CMS_SHIFT) /* 10: Center-aligned mode 2 */
#  define ATIM_CR1_CENTER3          (3 << ATIM_CR1_CMS_SHIFT) /* 11: Center-aligned mode 3 */
#define ATIM_CR1_ARPE               (1 << 7)                  /* Bit 7: Auto-reload preload enable */
#define ATIM_CR1_CKD_SHIFT          (8)                       /* Bits 9-8: Clock division */
#define ATIM_CR1_CKD_MASK           (3 << ATIM_CR1_CKD_SHIFT)
#  define ATIM_CR1_TCKINT           (0 << ATIM_CR1_CKD_SHIFT) /* 00: tDTS=tCK_INT */
#  define ATIM_CR1_2TCKINT          (1 << ATIM_CR1_CKD_SHIFT) /* 01: tDTS=2*tCK_INT */
#  define ATIM_CR1_4TCKINT          (2 << ATIM_CR1_CKD_SHIFT) /* 10: tDTS=4*tCK_INT */
#define ATIM_CR1_UIFREMAP           (1 << 11)                 /* Bit 11: UIF status bit remapping */

